import dateFormat, { i18n } from "dateformat";

export default () => {
  i18n.dayNames = [
    "Вс",
    "Пн",
    "Вт",
    "Ср",
    "Чт",
    "Пт",
    "Сб",
    "Воскресенье",
    "Понедельник",
    "Вторник",
    "Среда",
    "Вторник",
    "Пятница",
    "Суббота",
  ];

  i18n.monthNames = [
    "Янв",
    "Фев",
    "Мар",
    "Апр",
    "Май",
    "Июн",
    "Июл",
    "Авг",
    "Сен",
    "Окт",
    "Ноя",
    "Дек",
    "Января",
    "Февраля",
    "Марта",
    "Апреля",
    "Мая",
    "Июня",
    "Июля",
    "Августа",
    "Сентября",
    "Октября",
    "Ноября",
    "Декабря",
  ];

  const getDate = (date: any) => {
    return dateFormat(date, "d mmmm yyyy 'в' HH:MM:ss");
  };

  return { getDate };
};
